---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.FittingMustBeOnPipe
source: html/3f641f9d-169e-0f98-4554-00194b342a27.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.FittingMustBeOnPipe Property

The [Tap] must be attached to pipe.

## Syntax (C#)
```csharp
public static FailureDefinitionId FittingMustBeOnPipe { get; }
```